notes-md/20250117101422-journal_backend_01172025.md

# Table of Contents

1.  [To-Do's](#orga63fdae)
2.  [Emotions](#org26b4fad)

Lo principal en este log es que he decidido no realizar los proyectos de estudio de python en C++ y el GUI, esto es porque creo que será más eficiente solo aprender el trasfondo (a programar) porque esto sería el 20% de mi regla de parapeto. Me centraré en aprender bien python para backend y olvidarme del frontend, al menos como objetivo principal, tal vez más adelante aprenda tkinter y C++.

My laptop bat is 10% now, this mark my break time. When I return from my break I should focus on my todo's

**15:00:** I feel bad, I feel like I am alone, but I must persist because I want to be great. My laptop bat is 30% I have completed the multiclipboard project and the adding bullets too, notes and implementation. After the break I will have to complete the pig latin mini project.

**22:30:** Recién regreso del break, me consumió el LoL, pero también fui a correr, corrí más de 4km forzandome hasta el último, estoy orgulloso por eso. Por ahora voy a intentar hacer el planning del [Pig Latin Translator](20250117135603-pig_latin_translator.md)

**23:00**: Finished the planning of the pig latin project. I did fast because I want to take a shower and eat, maybe after eating I will do the implementation of the pig latin translator and the planning of the table printer.

El resto continua en [Journal - Backend - 01182025](20250118005223-journal_backend_01182025.md)


<a id="orga63fdae"></a>

# To-Do's

-   [X] Do the projects of the chapter (Multi-clipboard automatic messages, Adding Bullets to wiki markup, pig latin.)
    -   [X] [Multiclipboard automated messages](20250117101852-multiclipboard_automated_messages.md)
    -   [X] [Adding Bullets to Wiki markup](20250117135546-adding_bullets_to_wiki_markup.md)
    -   [X] [Pig Latin Translator](20250117135603-pig_latin_translator.md)
-   [ ] Do the exercises of the chapter (table printer, zombie dice bots)
-   [ ] Do the note for strings in python [Python Strings](20250114133247-python_strings.md)
-   [ ] Translate the beginning of this note to english


<a id="org26b4fad"></a>

# Emotions

-   I feel like I am going nowhere with programming I am feeling overwhelm by the thought that I have to build some amazing projects to get just a interview, I fell like I can't do it because I can't think of a project that big.

